{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMUdTiTk2wj06USF3X3is26"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["# Задание 1"],"metadata":{"id":"DTHmwc51TN60"}},{"cell_type":"markdown","source":["Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n","\n","- среднюю букву, если число букв в слове нечетное;\n","- две средних буквы, если число букв четное."],"metadata":{"id":"J-7yq09-TTo7"}},{"cell_type":"code","execution_count":7,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"cddiLi1NTD8e","executionInfo":{"status":"ok","timestamp":1675339586047,"user_tz":-180,"elapsed":20196,"user":{"displayName":"Елизавета Минеева","userId":"11232042671169352755"}},"outputId":"81dcd664-dbae-4c0f-c65c-002e3fb47bcd"},"outputs":[{"output_type":"stream","name":"stdout","text":["index\n","d\n"]}],"source":["item = input()\n","index_1 = len(item)\n","index_2 = index_1 // 2\n","index_3 = index_2 - 1\n","if index_1 % 2 == 0:\n","  print(item[index_3:index_2+1])\n","else:\n","  print(item[index_2])"]},{"cell_type":"markdown","source":["## Задание 2"],"metadata":{"id":"uA6RVL96-d92"}},{"cell_type":"markdown","source":["Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел."],"metadata":{"id":"fIo6ZahV-fal"}},{"cell_type":"code","source":["num = int(input())\n","count = 0\n","\n","while num != 0:\n","  count += num\n","  num = int(input())\n","\n","print(count)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"d0AOVKod-eOK","executionInfo":{"status":"ok","timestamp":1675339534755,"user_tz":-180,"elapsed":6640,"user":{"displayName":"Елизавета Минеева","userId":"11232042671169352755"}},"outputId":"1c49b0c6-6cb3-4887-c5d0-cae158f71fb4"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["1\n","2\n","0\n","3\n"]}]},{"cell_type":"markdown","source":["## Задание 3"],"metadata":{"id":"NuKKdUxnBX5k"}},{"cell_type":"markdown","source":["Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.\n","Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары."],"metadata":{"id":"Cu3mhxWoEIGb"}},{"cell_type":"code","source":["men = ['Peter','Alex', 'John', 'Arthur', 'Richard']\n","women = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n","if len(men) == len(women):\n","    men.sort()\n","    women.sort()\n","    men_and_women = zip(men, women)\n","    print(\"Идеальные пары: \")\n","    for i in men_and_women:\n","        print(f\"{i[0]} и {i[1]}\")\n","else:\n","    print(\"Внимание, кто-то может остаться без пары!\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ttDvlTp0Eblp","executionInfo":{"status":"ok","timestamp":1675405165320,"user_tz":-180,"elapsed":706,"user":{"displayName":"Елизавета Минеева","userId":"11232042671169352755"}},"outputId":"8c9ec719-6d50-41e0-e623-f784c438477c"},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Идеальные пары: \n","Alex и Emma\n","Arthur и Kate\n","John и Kira\n","Peter и Liza\n","Richard и Trisha\n"]}]},{"cell_type":"code","source":["men = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']\n","women = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n","if len(men) == len(women):\n","    men.sort()\n","    women.sort()\n","    men_and_women = zip(men, women)\n","    print(\"Идеальные пары: \")\n","    for i in men_and_women:\n","        print(f\"{i[0]} и {i[1]}\")\n","else:\n","    print(\"Внимание, кто-то может остаться без пары!\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"hBGc9QOl5tjJ","executionInfo":{"status":"ok","timestamp":1675407090622,"user_tz":-180,"elapsed":1065,"user":{"displayName":"Елизавета Минеева","userId":"11232042671169352755"}},"outputId":"5b087682-9ba0-48dc-d42a-589b9569691b"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Внимание, кто-то может остаться без пары!\n"]}]},{"cell_type":"markdown","source":["## Задание 4"],"metadata":{"id":"0Q27LQccEOIO"}},{"cell_type":"markdown","source":["У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны."],"metadata":{"id":"s9TivN2GET4y"}},{"cell_type":"code","source":["countries_temperature = [\n","    ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n","    ['Germany', [57.2, 55.4, 59, 59, 53.6]],\n","    ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n","    ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n","]\n","print(\"Средняя температура в странах:\")\n","for i in countries_temperature:\n","  print(f\"{i[0]} - {round((((sum(i[1])/len(i[1])) - 32)/1.8), 1)} C\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"2JqYxMByEdMp","executionInfo":{"status":"ok","timestamp":1675408140490,"user_tz":-180,"elapsed":416,"user":{"displayName":"Елизавета Минеева","userId":"11232042671169352755"}},"outputId":"9f1a5764-f8c5-44f8-f4a0-0513277483fc"},"execution_count":9,"outputs":[{"output_type":"stream","name":"stdout","text":["Средняя температура в странах:\n","Thailand - 23.9 C\n","Germany - 13.8 C\n","Russia - 3.7 C\n","Poland - 12.0 C\n"]}]}]}